package ru.otus.java.basic.hw9;

public class Employee {
    //Создайте класс Сотрудник с полями: имя, возраст;
//Реализуйте метод, принимающий в качестве аргумента список сотрудников, и возвращающий список их имен;
//Реализуйте метод, принимающий в качестве аргумента список сотрудников и минимальный возраст, и возвращающий список сотрудников, возраст которых больше либо равен указанному аргументу;
//Реализуйте метод, принимающий в качестве аргумента список сотрудников и минимальный средний возраст, и проверяющий что средний возраст сотрудников превышает указанный аргумент;
//Реализуйте метод, принимающий в качестве аргумента список сотрудников, и возвращающий ссылку на самого молодого сотрудника.

}
